Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/tax/income_tax/how_your_tax_is_calculated.html.txt.tmx
Source language: en
Languages: ga

source: The tax credits are subtracted from the gross tax to give the tax payable
ga: Baintear na creidmheasanna cánacha ón ollcháin chun a cháin iníoctha a thabhairt

source: Under marginal relief the tax liability would be calculated as follows
ga: Faoi fhaoiseamh imeallach ríomhfaí a dhliteanas cánach mar a leanas

source: Low income exemption limit: €36,000
ga: Teorainn díolúine ioncaim íseal: €36,000

source: Gives €4,000 as the amount by which the income exceeds the limit
ga: Tugann sé €4,000 ar an méid a sháraíonn an t-ioncam an teorainn

source: Marginal relief restricts the tax payable to 40% of this
ga: Cúngaíonn faoiseamh imeallach an cháin iníoctha ar 40% de seo

source: Some work expenses can be deducted from your income before it is assessed for tax
ga: Is féidir roinnt costais oibre a asbhaint as d’ioncam sula ndéantar measúnú air do cháin

source: To qualify, the expenses must be necessary in order to do your work and must have been spent entirely for that purpose and no other
ga: Féach eolas na gCoimisinéirí Ioncaim do thuilleadh sonraí ar chostais ar féidir a asbhaint chúiseanna cánacha

source: See Revenue for more information on expenses that can be deducted for tax purposes
ga: Féach cásanna staidéir do shampla ar an gcaoi a infheidhmítear liúntais nuair a ríomhtar cáin ioncaim
